lib/soap-templates/GetCategoryTerms.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:job="http://jobboard.webservice.madgex.co.uk">
   <soapenv:Header/>
   <soapenv:Body>
      <job:GetCategoryTerms>
         <job:sCategoryID>{{categoryId}}</job:sCategoryID>
      </job:GetCategoryTerms>
   </soapenv:Body>
</soapenv:Envelope>